chore: updated readme and added example env structure for backend and frontend
